server/app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events"  ORDER BY "events"."id" ASC

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2015-09-18 03:58:21.876958"], ["updated_at", "2015-09-18 03:58:21.876958"]]

  def find_event
    Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ?  ORDER BY "events"."id" ASC LIMIT 1  [["id", 1]]