server/app/controllers/users_controller.rb

  def index
    if params[:filter]
      @users = User.find_by(oauth_token: params[:filter][:oauth_token])
    else
      @users = User.all
---
SELECT "users".* FROM "users"  ORDER BY "users"."id" ASC

  def create
    @user = User.find_or_initialize_by(uid: user_params[:uid])
    if @user
      @user.update_attributes(user_params)
      render json: {user: @user}
    else
      @user = User.new(user_params)
       if @user.save
---
INSERT INTO "users" ("name", "pic_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["pic_url", "dfgdfgdfg"], ["created_at", "2015-09-18 04:02:10.321187"], ["updated_at", "2015-09-18 04:02:10.321187"]]

  def find_user
    User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 23]]