server/app/views/events/index.json.jbuilder


json.events @events.each do |event|
---
SELECT "events".* FROM "events"