app/controllers/events_controller.rb

SELECT "events".* FROM "events"  ORDER BY "events"."id" ASC
---
  def index
    @events = Event.all

SELECT "users".* FROM "users" INNER JOIN "user_events" ON "users"."id" = "user_events"."user_id" WHERE "user_events"."event_id" = ?  [["event_id", "13"]]
---
  def show
    @event = find_event
    #update_image(@event)

    @users = @event.users
    @users_id_array = @users.collect(&:id)

INSERT INTO "events" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2015-09-18 03:58:21.876958"], ["updated_at", "2015-09-18 03:58:21.876958"]]
---
  def create
    @event = Event.new(event_params)
    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ?  ORDER BY "events"."id" ASC LIMIT 1  [["id", 1]]
---
  def find_event
    Event.find(params[:id])