app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."id" ASC
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "pic_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["pic_url", "dfgdfgdfg"], ["created_at", "2015-09-18 04:02:10.321187"], ["updated_at", "2015-09-18 04:02:10.321187"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 23]]
---
  def find_user
    User.find(params[:id])